IDENTIFICATION DIVISION.
PROGRAM-ID. [].


ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT ファイル項目 ASSIGN TO 'ファイル名'


DATA DIVISION.
FILE SECTION.
FD ファイル項目.
01 ファイルレコード. 
05 データ項目1 PIC 9(5).
05 データ項目2 PIC X(3).

PROCEDURE DIVISION.
MAIN SECTION.

COMPUTE AGE = AGE + YEARS.
ADD YEARS TO AGE.

COMPUTE X = (- B + (B ** 2 - 4 * A * C) ** 0.5) / (2 * A).
MULTIPLY B BY B GIVING B-SQUARED.（BをB倍し、B-SQUAREDに代入）
MULTIPLY 4 BY A GIVING FOUR-A.（Aを4倍し、FOUR-Aに代入）
MULTIPLY FOUR-A BY C GIVING FOUR-A-C.（CをFOUR-A倍し、FOUR-A-Cに代入）
SUBTRACT FOUR-A-C FROM B-SQUARED GIVING D.（B-SQUAREDからFOUR-A-Cを引き、Dに代入）
MOVE FUNCTION SQRT(D) TO ROOT-D.（Dの正の平方根を、ROOT-Dに代入）
SUBTRACT B FROM ROOT-D GIVING NUMERATOR.（ROOT-DからBを引き、NUMERATORに代入）
MULTIPLY 2 BY A GIVING TWO-A.（Aを2倍し、TWO-Aに代入）
DIVIDE NUMERATOR BY TWO-A GIVING X.（NUMERATORをTWO-Aで割り、Xに代入）

 
実行処理...
 
STOP RUN.




IDENTIFICATION DIVISION.
PROGRAM-ID. SUBTRACT_SAMPLE01.
 
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WORK-AREA.
03 WORK-GROUP-1.
05 WORK-NUM PIC 9(3).
05 WORK-SUM PIC 9(3).
 
PROCEDURE DIVISION.
MAIN SECTION.
*>値を設定する
MOVE 100 TO WORK-NUM.
MOVE 300 TO WORK-SUM.
*>WORK-SUMに減算した結果を保存する
SUBTRACT WORK-NUM FROM WORK-SUM.
*>結果を出力する
DISPLAY "結果: "WORK-SUM.
STOP RUN.
